def getArea(context):
    area_data = {
            '北京': ['北京','朝阳', '海淀', '通州', '房山', '丰台', '昌平', '大兴', '顺义', '西城', '延庆', '石景山', '宣武', '怀柔', '崇文', '密云',
                   '东城', '门头沟', '平谷'],
            '广东':['广东', '东莞', '广州', '中山', '深圳', '惠州', '江门', '珠海', '汕头', '佛山', '湛江', '河源', '肇庆','潮州', '清远', '韶关', '揭阳', '阳江', '云浮', '茂名', '梅州', '汕尾'],
            '山东':['山东', '济南', '青岛', '临沂', '济宁', '菏泽', '烟台','泰安', '淄博', '潍坊', '日照', '威海', '滨州', '东营', '聊城', '德州', '莱芜', '枣庄'],
            '江苏':['江苏', '苏州', '徐州', '盐城', '无锡','南京', '南通', '连云港', '常州', '扬州', '镇江', '淮安', '泰州', '宿迁'],
            '河南':['河南', '郑州', '南阳', '新乡', '安阳', '洛阳', '信阳','平顶山', '周口', '商丘', '开封', '焦作', '驻马店', '濮阳', '三门峡', '漯河', '许昌', '鹤壁', '济源'],
            '上海':['上海', '松江', '宝山', '金山','嘉定', '南汇', '青浦', '浦东新', '奉贤', '闵行', '徐汇', '静安', '黄浦', '普陀', '杨浦', '虹口', '闸北', '长宁', '崇明', '卢湾'],
            '河北':[ '河北', '石家庄', '唐山', '保定', '邯郸', '邢台', '沧州', '秦皇岛', '张家口', '衡水', '廊坊', '承德'],
            '浙江':['浙江', '温州', '宁波','杭州', '台州', '嘉兴', '金华', '湖州', '绍兴', '舟山', '丽水', '衢州'],
            '陕西':['陕西', '西安', '咸阳', '宝鸡', '汉中', '渭南','安康', '榆林', '商洛', '延安', '铜川'],
            '湖南':[ '湖南', '长沙', '邵阳', '常德', '衡阳', '株洲', '湘潭', '永州', '岳阳', '怀化', '郴州','娄底', '益阳', '张家界', '湘西州'],
            '重庆':[  '重庆', '江北', '渝北', '沙坪坝', '九龙坡', '万州', '永川', '南岸', '酉阳', '北碚', '涪陵', '秀山', '巴南', '渝中', '石柱', '忠', '合川', '大渡口', '开', '长寿', '荣昌', '云阳', '梁平', '潼南', '江津', '彭水', '璧山', '綦江',
         '大足', '黔江', '巫溪', '巫山', '垫江', '丰都', '武隆', '万盛', '铜梁', '南川', '奉节', '双桥', '城口'],
            '福建':['福建', '漳州', '泉州','厦门', '福州', '莆田', '宁德', '三明', '南平', '龙岩'],
            '天津':['天津', '和平', '北辰', '河西', '西青', '津南', '东丽', '武清','宝坻', '红桥', '大港', '汉沽', '静海', '宁河', '塘沽', '蓟', '南开', '河东'],
            '云南':[ '云南', '昆明', '红河州', '大理州', '文山州', '德宏州', '曲靖', '昭通', '楚雄州', '保山', '玉溪', '丽江地', '临沧地', '思茅地', '西双版纳州', '怒江州', '迪庆州'],
            '四川':['四川', '成都', '绵阳', '广元','达州', '南充', '德阳', '广安', '阿坝州', '巴中', '遂宁', '内江', '凉山州', '攀枝花', '乐山', '自贡', '泸州', '雅安', '宜宾', '资阳','眉山', '甘孜州'],
            '广西':['广西壮族自治', '贵港', '玉林', '北海', '南宁', '柳州', '桂林', '梧州', '钦州', '来宾', '河池', '百色', '贺州', '崇左',  '防城港'],
            '安徽':['安徽', '芜湖', '合肥', '六安', '宿州', '阜阳','安庆', '马鞍山', '蚌埠', '淮北', '淮南', '宣城', '黄山', '铜陵', '亳州','池州', '巢湖', '滁州'],
            '海南':['海南', '三亚', '海口', '琼海', '文昌', '东方', '昌江', '陵水', '乐东', '五指山', '保亭', '澄迈', '万宁','儋州', '临高', '白沙', '定安', '琼中', '屯昌'],
            '江西':['江西', '南昌', '赣州', '上饶', '吉安', '九江', '新余', '抚州', '宜春', '景德镇', '萍乡', '鹰潭'],
            '湖北':['湖北', '武汉', '宜昌', '襄樊', '荆州', '恩施州', '孝感', '黄冈', '十堰', '咸宁', '黄石', '仙桃', '随州', '天门', '荆门', '潜江', '鄂州', '神农架林'],
            '山西':['山西', '太原', '大同', '运城', '长治', '晋城', '忻州', '临汾', '吕梁', '晋中', '阳泉', '朔州'],
            '辽宁':['辽宁', '大连', '沈阳', '丹东', '辽阳', '葫芦岛', '锦州', '朝阳', '营口', '鞍山', '抚顺', '阜新', '本溪', '盘锦', '铁岭'],
            '台湾':['台湾','台北', '高雄', '台中', '新竹', '基隆', '台南', '嘉义'],
            '黑龙江':['黑龙江', '齐齐哈尔', '哈尔滨', '大庆', '佳木斯', '双鸭山', '牡丹江', '鸡西','黑河', '绥化', '鹤岗', '伊春', '大兴安岭地', '七台河'],
            '内蒙古':['内蒙古自治', '赤峰', '包头', '通辽', '呼和浩特', '乌海', '鄂尔多斯', '呼伦贝尔','兴安', '巴彦淖尔', '乌兰察布', '锡林郭勒', '阿拉善'],
            '香港':["香港","香港特别行政"],
            '澳门':['澳门','澳门特别行政'],
            '贵州':['贵州', '贵阳', '黔东南州', '黔南州', '遵义', '黔西南州', '毕节地', '铜仁地','安顺', '六盘水'],
            '甘肃':['甘肃', '兰州', '天水', '庆阳', '武威', '酒泉', '张掖', '陇南地', '白银', '定西地', '平凉', '嘉峪关', '临夏回族自治州','金昌', '甘南州'],
            '青海':['青海', '西宁', '海西州', '海东地', '海北州', '果洛州', '玉树州', '黄南藏族自治州'],
            '新疆':['新疆','新疆维吾尔自治', '乌鲁木齐', '伊犁州', '昌吉州','石河子', '哈密地', '阿克苏地', '巴音郭楞州', '喀什地', '塔城地', '克拉玛依', '和田地', '阿勒泰州', '吐鲁番地', '阿拉尔', '博尔塔拉州', '五家渠',
         '克孜勒苏州', '图木舒克'],
            '西藏':['西藏', '拉萨', '山南地', '林芝地', '日喀则地', '阿里地', '昌都地', '那曲地'],
            '吉林':['吉林', '延边', '长春', '白山', '白城','延边州', '松原', '辽源', '通化', '四平'],
            '宁夏':['宁夏回族自治', '银川', '吴忠', '中卫', '石嘴山', '固原']
        }

    p=""
    for k, v in area_data.items():
        # print(k)
        # print(v)
        count=0
        for i in v:
            count=count+1
            # print(i)
            if count==1:
                if i in context:
                    p=i
                    continue
            if i in context:
                # print(i)
                # print(k)
                return k,i
    return p,""

province,city=getArea("台湾")
print(province)
print(city)